#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.tc-g8-resource-group will be created
  + resource "azurerm_resource_group" "tc-g8-resource-group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "tc-g8-resources"
    }

  # module.postgres.azurerm_postgresql_database.tc-g8-postgres-db will be created
  + resource "azurerm_postgresql_database" "tc-g8-postgres-db" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "tc-g8-postgres-db"
      + resource_group_name = "tc-g8-resources"
      + server_name         = "tc-g8-postgres-server"
    }

  # module.postgres.azurerm_postgresql_firewall_rule.tc-g8-postgres-db-firewall-rule will be created
  + resource "azurerm_postgresql_firewall_rule" "tc-g8-postgres-db-firewall-rule" {
      + end_ip_address      = "255.255.255.255"
      + id                  = (known after apply)
      + name                = "tc-g8-postgres-db-firewall-rule"
      + resource_group_name = "tc-g8-resources"
      + server_name         = "tc-g8-postgres-server"
      + start_ip_address    = "0.0.0.0"
    }

  # module.postgres.azurerm_postgresql_server.tc-g8-postgres-server will be created
  + resource "azurerm_postgresql_server" "tc-g8-postgres-server" {
      + administrator_login              = "psqladmin"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 7
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "eastus"
      + name                             = "tc-g8-postgres-server"
      + public_network_access_enabled    = true
      + resource_group_name              = "tc-g8-resources"
      + sku_name                         = "B_Gen5_1"
      + ssl_enforcement_enabled          = false
      + ssl_minimal_tls_version_enforced = "TLSEnforcementDisabled"
      + storage_mb                       = 5120
      + version                          = "11"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + postgres_db_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelfelixmoraes, Action: `pull_request`*